app/Controllers/Noticias.php

UPDATE `noticias` SET `estado` = 'publicado'
WHERE `id` = '10062'
---
    public function corregir()
    {
        $id = $_GET['id'];
        $Noticias = new NoticiasModel();


        // Obtener el 'builder' para la tabla deseada
        $builder = $Noticias->builder();

        // Realizar la actualización
        $builder->where('id', $id);
        $builder->set(['estado' => 'corregir']);
        $builder->update();