app/Controllers/Noticias.php

SELECT *
FROM `noticias`
WHERE `estado` = 'validar'
---
    public static function verificarFechaPublicacion()
    {
        $Noticias = new NoticiasModel();
        $fechaActual = Time::now();
        $fechaConCincoDiasMenos = $fechaActual->subDays(5);
        $fechaFormateada = $fechaConCincoDiasMenos->toLocalizedString('yyyy-MM-dd');
        $fechaHoy = $fechaActual->toLocalizedString('yyyy-MM-dd');



        // // Obtén las publicaciones pendientes
        $publicacionesPendientes = $Noticias->where('estado', 'validar')->findAll();

UPDATE `noticias` SET `estado` = 'Borrador', `estado1` = 'Despublicada'
WHERE `id` = '36345'
---
    public function despublicar()
    {
        $id = $_GET['id'];
        var_dump($id);
        $Noticias = new NoticiasModel();

        // Obtener el 'builder' para la tabla deseada
        $builder = $Noticias->builder();

        // Realizar la actualización
        $builder->where('id', $id);
        $builder->set(['estado' => 'Borrador']);
        $builder->set(['estado1' => 'Despublicada']);

        $builder->update();