app/Models/NoticiasModel.php

SELECT *
FROM `noticias`
---
    public function mostrar_todo(){
        $Noticias = $this->db->table('noticias');
        return $Noticias->get()->getResultArray();

SELECT *
FROM `noticias`
WHERE `id` = '10052'
---
    public function mostrar_noticia($id){
            $Noticias = $this->db->table('noticias');
            $Noticias->where($id);
            return $Noticias->get()->getResultArray();